import React from 'react'
import { Provision } from './makeContract'

const contract = {
   1: {
      category: 'Зорилго',
      provisions: [{
         order: '1.1',
         provision: 'Дэлхийн банк (цаашид Банк гэх)-ны Хөрөнгө оруулалтын төслийн санхүүжилт бүхий худалдан авах ажиллагаанд Дэлхийн банкны Авлигатай тэмцэх журам болон энэхүү хавсралтыг мөрдөнө.',
         subLevel: 0
      }]
   },
   2: {
      category: 'Шаардлага',
      provisions: [{
         order: '2.1',
         provision: 'Банк нь зээлдэгч (Банкны санхүүжилтээс үр шим хүртэгчдийг оролцуулан); тендерт оролцогч, зөвлөх, гүйцэтгэгч болон нийлүүлэгч; аливаа туслан гүйцэтгэгч, дэд зөвлөхүүд, үйлчилгээ үзүүлэгч эсхүл нийлүүлэгч, аливаа төлөөлөгч этгээд (мэдүүлсэн эсэхээс хамааран); тэдгээрийн аливаа мэргэжилтнийг Банкны санхүүжилт бүхий гэрээний худалдан авах ажиллагааны туршид сонгон шалгаруулалтад оролцох, гэрээ хэрэгжүүлэхдээ ёс зүйн өндөр стандартыг ханган ажиллах, залилан мэхлэх, авлигын үйлдлээс ангид байхыг шаардана.',
         subLevel: 0
      }, {
         order: '2.2',
         provision: 'Энэ хүрээнд Банк нь:',
         subLevel: 0
      }, {
         order: '2.2.1',
         provision: 'Дараах нэр томьёог дор өгөгдсөн утгаар тусгасан болно. Үүнд:',
         subLevel: 1
      }, {
         order: 'i',
         provision: '“Авлигын үйлдэл” гэж нөгөө талын этгээдийн үйл ажиллагаанд зүй бусаар нөлөөлөхийн тулд аливаа үнэ бүхий зүйлийг шууд болон шууд бус хэлбэрээр өгөхийг санал болгох, өгөх, хүлээн авах, өгөхийг шаардахыг хэлнэ;',
         subLevel: 2
      }, {
         order: 'ii',
         provision: '“Залилан мэхлэх үйлдэл” гэж аль нэг тал хүлээсэн үүргээсээ зайлсхийх эсхүл санхүүгийн болон бусад ашиг олохын тулд санаатай болон санаандгүйгээр төөрөгдүүлэх, төөрөгдүүлэхийг оролдох аливаа үйлдэл, эс үйлдэхүй хийгээд дээрх зорилгоор хийгдсэн зөрүүтэй тайлбарыг хэлнэ;',
         subLevel: 2
      }, {
         order: 'iii',
         provision: '“Үгсэн хуйвалдах үйлдэл” гэж нөгөө талын этгээдийн үйл ажиллагаанд зүй бусаар нөлөөлөх зэрэг байдлаар хууль бус зорилгод хүрэхийн тулд хоёр буюу түүнээс дээш талууд хамтран далд тохиролцох ажиллагааг хэлнэ;',
         subLevel: 2
      }, {
         order: 'iv',
         provision: '“Тулган шаардах үйлдэх” гэж нөгөө талын этгээдийн үйл ажиллагаанд зүй бусаар нөлөөлөх, эсхүл хэн нэгэн этгээд эсхүл түүний өмчид шууд болон шууд бусаар хохирол учруулах, хохирол учруулахаар заналхийлэхийг хэлнэ.',
         subLevel: 2
      }, {
         order: 'v',
         provision: '“Саад учруулах үйлдэл” гэж:',
         subLevel: 2
      }, {
         order: '1',
         provision: 'Хяналт шалгалтын нотолгооны материалыг зориудаар устгах, хуурамчаар үйлдэх, өөрчлөх, нуун дарагдуулах, эсхүл авлига, залилан мэхлэх, нууцаар үгсэн хуйвалдах, албадан шахах буюу тулган шаардах үйлдлийг тогтоохоор Банкнаас хэрэгжүүлж буй хянан шалгах ажиллагаанд зориудаар саад учруулах зорилгоор асуудлыг шалгаж байгаа мөрдөгчид худал мэдүүлэх; эсхүл тухайн хянан шалгах ажиллагаатай холбогдох мэдээллийг мэдэж буй хүн өөрийг нь илчлэхээс сэргийлж айлган сүрдүүлэх, дарамтлах, заналхийлэх, мөн шалгалтын дараа гарсан шийдвэрийг дагаж мөрдөхөөс татгалзах зэрэг үйлдэл;',
         subLevel: 3
      }, {
         order: '2',
         provision: 'Хөрөнгө оруулалтын төслийн санхүүжилтийн зээлдэгчдэд зориулсан Худалдан авах ажиллагааны журмын Хавсралт 4-ийн 2.2 е-д заасны дагуу Банкны зүгээс хянан шалгах болон аудитын эрхээ хэрэгжүүлэхэд нь ноцтой саад учруулахаар завдах үйлдлийг хэлнэ.',
         subLevel: 3
      }]
   }
}

export default function ContractAttach6() {
   return (
      <div className="tw-text-sm tw-text-gray-700 tw-w-11/12 tw-max-w-5xl tw-mx-auto tw-pt-6 tw-pb-20">
         <div className="tw-bg-white tw-rounded-lg tw-shadow-md tw-p-2 tw-border-t tw-border-gray-100">
            <div className="tw-text-base tw-font-medium tw-text-center tw-mt-6 tw-mx-2 sm:tw-mx-8">
               Хавсралт 6  Авлига, залилан мэхлэх үйлдлийн талаарх Дэлхийн Банкны бодлого, тэдгээрт шалгалт, аудит хийх Дэлхийн Банкны эрх
            </div>

            <div className="tw-font-light tw-text-center tw-mt-2 tw-mx-4 sm:tw-mx-12">
               (Энэхүү хавсралтад заасныг гэрээний нөхцөлд өөрчлөхгүйгээр тусгана)
            </div>

            <div className="tw-mx-2 sm:tw-mx-8 tw-mt-8 tw-pb-10">
               {Object.entries(contract).map(([key, value]) =>
                  <div className="" key={key}>
                     <Header header={`${key} ДҮГЭЭР ЗҮЙЛ. ${value.category?.toUpperCase()}`} key={key} />

                     {value.provisions.map(provision =>
                        <Provision
                           order={provision.order}
                           provision={provision.provision}
                           subLevel={provision.subLevel}
                           key={provision.order}
                        />
                     )}
                  </div>
               )}
            </div>
         </div>
      </div>
   )
}

function Header({ header }) {
   return <div className="tw-font-medium tw-mt-2 tw-mx-2">
      {header}
   </div>
}
