import React from 'react'

const environmental = {
   1: 'Санхүүгийн дэмжлэг олгогч нь зөвхөн Байгаль орчин, нийгмийн удирдлагын баримт бичгийн “B” ба “C” ангилалд хамаарах Дэмжлэг хүртэгчийн биет бус хөрөнгө оруулалтыг санхүүжүүлнэ.',
   2: 'Санхүүгийн дэмжлэг хүртэгч нь 1) Байгаль орчин, эрүүл мэнд, хөдөлмөрийн аюулгүй байдлын талаарх Монгол Улсын холбогдох бүхий л хууль тогтоомж; 2) Дэлхийн банкны “Хамгааллын бодлого” болон Экспортыг дэмжих төслийн Байгаль орчин, нийгмийн удирдлагын баримт бичиг; 3) Дэмжлэг хүртэгчийн байгаль орчин, нийгмийн удирдлагын болон хяналт шинжилгээний төлөвлөгөөнд заасан бүх арга хэмжээ, шаардлагыг дагаж мөрдөх үүрэгтэй.',
   3: 'Санхүүгийн дэмжлэг хүртэгч нь байгаль орчин, нийгмийн удирдлагын төлөвлөгөө, хяналт шинжилгээний төлөвлөгөөг хэрэгжүүлэхэд хангалттай ур чадвар бүхий мэргэшсэн ажилтныг томилно.Шаардлагатай тохиолдолд Дэмжлэг хүртэгчийн хөдөлмөрийн эрүүл мэнд, аюулгүй байдлыг хариуцсан ажилтан байгаль орчин, нийгмийн удирдлагын асуудлыг хавсран хариуцаж болно. Томилогдсон ажилтан нь түншлэлийн хугацаанд байгаль орчин, эрүүл мэнд, аюулгүй ажиллагаатай холбоотой бүх асуудлыг хариуцан ажиллана.',
   4: 'Санхүүгийн дэмжлэг хүртэгч нь үйл ажиллагааг хэрэгжүүлэх хугацаанд хамгааллын үйл ажиллагааны холбогдох төлөвлөгөөг хэрэгжүүлэх хангалттай санхүүгийн эх үүсвэртэй байна.',
   5: 'Санхүүгийн дэмжлэг хүртэгч нь байгаль орчны хяналт, шинжилгээ(Хөрс, ус, агаарын бохирдол, дуу чимээ г.м) - г Байгаль орчин, аялал жуулчлалын яамнаас олгосон тусгай зөвшөөрөл бүхий аж ахуйн нэгжтэй гэрээ байгуулан гүйцэтгүүлнэ.',
   6: 'Хэрэв Дэлхийн банкны шаардлага болон Монгол Улсын Байгаль орчин, нийгмийн удирдлагын стандартуудын хооронд зөрүү үүсвэл дээрх хоёр шаардлага / стандартын аль хатуу шаардлага / стандартыг Санхүүгийн дэмжлэг хүртэгч дагаж мөрдөх үүрэгтэй.',
   7: 'Хамгааллын үйл ажиллагааны хяналтын тайлан / Төслөөс өгсөн форматын дагуу бэлтгэсэн зөвлөлдөх уулзалт, гомдол барагдуулалттай холбоотой мэдээлэл бүхий байгаль орчин, нийгмийн удирдлага, хяналт шинжилгээний төлөвлөгөөний тайланг цаг тухайд нь бэлтгэн ирүүлэх.',
   8: 'Санхүүгийн дэмжлэг хүртэгч нь Байгаль орчин, нийгмийн удирдлага, хяналт шинжилгээний төлөвлөгөөг хангалтгүй хэрэгжүүлсэн болох нь тогтоогдвол Санхүүгийн дэмжлэг олгогч нь санхүүгийн дэмжлэг олгохоос татгалзана.'
}

const gender = {
   1: 'Санхүүгийн дэмжлэг хүртэгч нь нь яс үндэс, хүйс, нас харгалзалгүй ижил хэмжээний ажилд ижил хэмжээний цалин хөлс олгоно. Ажилтнуудтай хөдөлмөрийн болон хөлсөөр ажиллах гэрээ бичгээр хийсэн байна. Цалин хөлсийг цаг тухайд нь олгоно. Хөдөлмөрийн тухай хууль, дүрэм журам, стандарт, ажил эрхлэлт, эрүүл мэнд, аюулгүй байдал, нийгмийн халамжийн хууль тогтоомжуудад нийцүүлэн орон нутгаас туслах ажилтан/мэргэжилгүй ажиллах хүчнийг авч ажиллуулахыг эрхэмлэнэ. Хүүхдийн хөдөлмөр ашиглахыг хориглоно. Гүйцэтгэгч нь мөн хүн тус бүрээр ажил эрхлэлтийн бүртгэл хөтөлнө. Үүнд нэр, яс үндэс, нас, хүйс, хаяг, ажилласан огноо, хугацаа болон олгосон цалин зэргийг хөтөлнө.',
   2: 'Санхүүгийн дэмжлэг хүртэгч нь мэргэжилгүй, ядуу, хөгжлийн бэрхшээлтэй иргэдийг дэд төслийн ажил болон үйлчилгээнд аль болох ажиллуулах, тэдний тоог нэмэгдүүлэхийг чухалчилна. Орон нутгаас ажиллуулах иргэдийн 50-иас доошгүй хувь нь эмэгтэйчүүд байна.',
   3: 'Эмэгтэй болон эрэгтэй ажилчдыг хүйсийн онцлогийг харгалзсан эрүүл ахуйн шаардлага хангасан ариутгах татуурга бүхий бие засах өрөөгөөр хангана.',
   4: 'Гэрээний хугацаанд бүх ажилтан, ажиллагсдыг эрүүл мэнд, хөдөлмөрийн аюулгүй байдлын сургалтад хамгийн багадаа нэг удаа хамруулна.',
   5: 'Санхүүгийн дэмжлэг хүртэгч нь байгаль орчин, нийгмийн удирдлагын асуудлаар олон нийтийн саналыг авч, Экспортыг дэмжих төслийн гомдол барагдуулах журмыг хэрэгжүүлж ажиллана.',
   6: 'Зөвлөлдөх уулзалтад эмэгтэйчүүдийн өргөн оролцоог бүрдүүлэхээс гадна төслийн нөлөөлөлд өртөх иргэд, хөгжлийн бэрхшээлтэй иргэд, хүүхэд, залуучууд, үндэсний цөөнх, төрийн бус байгууллагын төлөөллийг хангаж байгаль орчинд үзүүлэх бодит нөлөөллийг сааруулах талаарх тэдний саналыг дэмжлэг хүртэгчийн байгаль орчин, нийгмийн удирдлагын төлөвлөгөөнд тусган хэрэгжүүлнэ.',
   7: 'Санхүүгийн дэмжлэг олгогчийн зүгээс Үйл ажиллагааны төлөвлөгөөний хэрэгжилттэй газар дээр нь танилцаж, хяналт хийх тохиолдолд байгаль орчин, эрүүл мэнд, хөдөлмөр хамгаалал, жендер, нийгмийн хамгааллын талаарх мэдээ, тайланг цаг тухайд нь гаргаж өгөх.'
}

export default function ContractAttach5() {
   return (
      <div className="tw-text-sm tw-text-gray-700 tw-w-11/12 tw-max-w-5xl tw-mx-auto tw-pt-6 tw-pb-20">
         <div className="tw-bg-white tw-rounded-lg tw-shadow-md tw-p-2 tw-border-t tw-border-gray-100">
            <div className="tw-text-base tw-font-medium tw-text-center tw-mt-6 tw-mx-2 sm:tw-mx-8">
               Хавсралт 5.
            </div>

            <div className="tw-text-base tw-font-medium tw-text-center tw-mt-4 tw-mx-2 sm:tw-mx-8">
               1.	Байгаль орчин, эрүүл мэнд, аюулгүй ажиллагааны шаардлагууд
            </div>

            <div className="tw-mt-4 tw-mx-2 sm:tw-mx-8">
               {Object.entries(environmental).map(([key, value]) =>
                  <div className="tw-mt-2" key={key}>
                     <span className="tw-mr-4">
                        {key}.
                     </span>
                     {value}
                  </div>
               )}
            </div>

            <div className="tw-text-base tw-font-medium tw-text-center tw-mt-6 tw-mx-2 sm:tw-mx-8">
               2. Жендер, нийгмийн хамгааллын шаардлагууд
            </div>

            <div className="tw-mt-4 tw-mx-2 sm:tw-mx-8 tw-pb-10">
               {Object.entries(gender).map(([key, value]) =>
                  <div className="tw-mt-2" key={key}>
                     <span className="tw-mr-4">
                        {key}.
                     </span>
                     {value}
                  </div>
               )}
            </div>
         </div>
      </div>
   )
}
