

import React, {useContext} from 'react'
import styled from 'styled-components';
import HelperContext from '../../../context/HelperContext'

function ModalOne() {
    const HelpContext = useContext(HelperContext);
    console.log(HelpContext.tableSee.tableOneData, "1 this my helper global context");
    return (
        <TableOne >
            <h6>ҮЙЛДВЭРЛЭГЧ НЬ ДАРААХ ҮЙЛ АЖИЛЛАГААГ ЭРХЭЛДЭГ БА ЯВУУЛДАГ ЭСЭХ?</h6>
            <table className="table">
                <tr className="Header">
                    <th>Шалгуур</th>
                    <th>Хариулт</th>
                </tr>
                {dataOne.map(()=>{

                })}
                <tr>
                    <td>Цэрэг армийн ямар нэг зэвсэг</td>
                    <td>$100 100</td>
                </tr>
                <tr> 
                    <td>Зэрлэг амьтан, ургамлын ховордсон төрөл зүйлийг олон улсын хэмжээнд худалдаалах тухай конвенц (CITES)-ийн хүрээнд хориглодог ан амьтан, ургамлын худалдаа</td>
                    <td>$100</td>
                </tr>
                <tr>
                    <td>January</td>
                    <td>$100</td>
                </tr>
            </table>
        </TableOne> 
    )
}

export default ModalOne

const TableOne = styled.div`
    .table{
        width:100%;
        border:1px solid rgba(0,0,0,0.1);
        .Header{

        }
    }
`


const dataOne = [
    {
        name: "Цэрэг армийн ямар нэг зэвсэг"
    },
    {
        name: "Зэрлэг амьтан, ургамлын ховордсон төрөл зүйлийг олон улсын хэмжээнд худалдаалах тухай конвенц (CITES)-ийн хүрээнд хориглодог ан амьтан, ургамлын худалдаа"
    },
    {
        name: "Байгаль, хүрээлэн буй орчинд генийн өөрчлөлтөд орсон организмуудыг гаргах"
    },
    {
        name: "Хориглосон пестицид, хербицидийн үйлдвэрлэл, нийлүүлэлт, худалдаа"
    },
    {
        name: "Далай тэнгист тороор загас барих"
    },
    {
        name: "Цацраг идэвхт бүтээгдэхүүнүүд"
    },
    {
        name: "Аюултай хог хаягдлын хадгалалт, боловсруулалт, зайлуулалт"
    },
    {
        name: "Хлорфторт нүүрстөрөгчид, галлон болон Монреалийн протоколын хүрээнд зохицуулагддаг бусад бодисууд агуулсан тоног төхөөрөмж, хэрэгслийн үйлдвэрлэл"
    },
    {
        name: "Олон хлорт бефенилиудын үзүүлэх нөлөө 0.005 %-аас хэтэрсэн агууламж бүхий цахилгаан хэрэгсэл, тоног төхөөрөмжийн үйлдвэрлэл"
    },
    {
        name: "Шөрмөсөн чулуу агуулсан бүтээгдэхүүний үйлдвэрлэл"
    },
    {
        name: "Цөмийн реакторууд, тэдгээрийн хэсгүүд"
    },
    {
        name: "Тамхи (үйлдвэрлэлийн бус ба үйлдвэрлэлийн); Тамхины хатаасан навч боловсруулах машин"
    },
    {
        name: "Уул уурхайн салбарт"
    },
]